RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_netdev.c
/*
 * SPDX-FileCopyrightText: 2017 SKF AB
 * SPDX-License-Identifier: LGPL-2.1-only
 */

/**
 * @ingroup     drivers_kw41zrf
 * @{
 *
 * @file
 * @brief       Netdev interface for kw41zrf drivers
 *
 * @author      Joakim Nohlgård <joakim.nohlgard@eistec.se>
 */

#include <errno.h>
#include <stdint.h>
#include <string.h>
#include <assert.h>
#include <stdatomic.h>

#include "bit.h"
#include "log.h"
#include "random.h"
#include "thread_flags.h"
#include "net/eui64.h"
#include "net/ieee802154.h"
#include "net/netdev.h"
#include "net/netdev/ieee802154.h"

#include "kw41zrf.h"
#include "kw41zrf_netdev.h"
#include "kw41zrf_intern.h"
#include "kw41zrf_getset.h"
#include "vendor/MKW41Z4.h"

#if MODULE_OD
#include "od.h"
#endif

#define ENABLE_DEBUG 0
#include "debug.h"

#define _MAX_MHR_OVERHEAD           (25)

/* Timing units are in radio timer ticks (16 usec per tick) */
#define KW41ZRF_CCA_TIME               8
#define KW41ZRF_SHR_PHY_TIME          12
#define KW41ZRF_PER_BYTE_TIME          2
#define KW41ZRF_ACK_WAIT_TIME         54
#define KW41ZRF_CSMA_UNIT_TIME        20

static void kw41zrf_netdev_isr(netdev_t *netdev);

/* True while we've already queued a callback and don't need to queue another */
static atomic_bool irq_is_queued = false;

/* True while blocking the netdev thread waiting for some operation to finish */
static bool blocking_for_irq = false;

/* Set this to a flag bit that is not used by the MAC implementation */
#define KW41ZRF_THREAD_FLAG_ISR (1u << 8)

static void kw41zrf_irq_handler(void *arg)
{
    netdev_t *netdev = arg;
    netdev_ieee802154_t *netdev_ieee802154 = container_of(netdev,
                                                          netdev_ieee802154_t,
                                                          netdev);
    kw41zrf_t *dev = container_of(netdev_ieee802154, kw41zrf_t, netdev);

    KW41ZRF_LED_IRQ_ON;
    kw41zrf_mask_irqs();

    /* Signal to the thread that an IRQ has arrived, if it is waiting */
    thread_flags_set(dev->thread, KW41ZRF_THREAD_FLAG_ISR);

    /* Avoid filling the message queue with redundant ISR events */
    if (!irq_is_queued) {
        irq_is_queued = true;
        if (netdev->event_callback) {
            netdev->event_callback(netdev, NETDEV_EVENT_ISR);
        }
    }
}

static int kw41zrf_netdev_init(netdev_t *netdev)
{
    netdev_ieee802154_t *netdev_ieee802154 = container_of(netdev,
                                                          netdev_ieee802154_t,
                                                          netdev);
    kw41zrf_t *dev = container_of(netdev_ieee802154, kw41zrf_t, netdev);
    dev->thread = thread_get_active();

    /* initialize hardware */
    if (kw41zrf_init(dev, kw41zrf_irq_handler)) {
        LOG_ERROR("[kw41zrf] unable to initialize device\n");
        return -1;
    }

    /* signal link UP */
    netdev->event_callback(netdev, NETDEV_EVENT_LINK_UP);

    return 0;
}

/**
 * @brief Generate a random number for using as a CSMA delay value
 */
static inline uint32_t kw41zrf_csma_random_delay(kw41zrf_t *dev)
{
    /* Use topmost csma_be bits of the random number */
    uint32_t rnd = random_uint32() >> (32 - dev->csma_be);
    return (rnd * KW41ZRF_CSMA_UNIT_TIME);
}

static inline size_t kw41zrf_tx_load(const void *buf, size_t len, size_t offset)
{
    /* Array bounds are checked in the kw41zrf_netdev_send loop. */
    /* offset + 1 is used because buf[0] contains the frame length byte. */
    /* Don't use memcpy to work around a presumed compiler bug in
     * arm-none-eabi-gcc 7.3.1 2018-q2-6 */
    for (unsigned i = 0; i < len; i++) {
        ((uint8_t *)ZLL->PKT_BUFFER_TX)[i + offset + 1] = ((uint8_t *)buf)[i];
    }

    return offset + len;
}

/**
 * @brief set up TMR2 to trigger the TX sequence from the ISR
 */
static void kw41zrf_tx_exec(kw41zrf_t *dev)
{
    kw41zrf_abort_sequence(dev);

    if (dev->flags & KW41ZRF_OPT_CSMA) {
        /* Use CSMA/CA random delay in the interval [0, 2**dev->csma_be) */
        dev->backoff_delay = kw41zrf_csma_random_delay(dev);
    }

    /* less than 2 is sometimes in the past */
    if (dev->backoff_delay < 2) {
        dev->backoff_delay = 2;
    }

    /* Avoid risk of setting a timer in the past */
    int irq = irq_disable();
    kw41zrf_timer_set(dev, &ZLL->T2CMP, ~0ul);

    /* enable TMR2 */
    bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_TMRTRIGEN_SHIFT);
    bit_set32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_TMR2CMP_EN_SHIFT);

    /* Set real trigger time */
    kw41zrf_timer_set(dev, &ZLL->T2CMP, dev->backoff_delay);
    irq_restore(irq);
}

/**
 * @brief Block the current thread until the radio is idle
 *
 * Any ongoing TX or CCA sequence will have finished when this function returns.
 *
 * @param[in] dev       kw41zrf device descriptor
 */
static void kw41zrf_wait_idle(kw41zrf_t *dev)
{
    /* things that trigger this must run only from the netdev thread */
    assert(thread_getpid() == dev->thread->pid);

    /* make sure any ongoing T or TR sequence is finished */
    if (kw41zrf_can_switch_to_idle(dev) && dev->backoff_delay == 0) {
        return;
    }

    DEBUG("[kw41zrf] waiting for idle\n");
    /* we exit this wait using an IRQ so we can't do it from IRQ */
    assert(!irq_is_in());
    /* in case we're servicing an IRQ currently, IRQs will be masked */
    kw41zrf_unmask_irqs();

    assert(!blocking_for_irq);
    blocking_for_irq = true;

    PM_BLOCK(KW41ZRF_PM_BLOCKER);
    while (1) {
        /* TX or CCA or CSMA backoff in progress */
        /* Block until we get an IRQ */
        thread_flags_wait_any(KW41ZRF_THREAD_FLAG_ISR);
        /* Handle the IRQ */
        kw41zrf_netdev_isr(&dev->netdev.netdev);
        /* kw41zrf_netdev_isr() will switch the transceiver back to idle
         * after handling the sequence complete IRQ */
        if (kw41zrf_can_switch_to_idle(dev) && dev->backoff_delay == 0) {
            break;
        }
    }

    DEBUG("[kw41zrf] waited ISR\n");
    PM_UNBLOCK(KW41ZRF_PM_BLOCKER);
    blocking_for_irq = false;
}

int kw41zrf_cca(kw41zrf_t *dev)
{
    kw41zrf_wait_idle(dev);
    if (kw41zrf_is_dsm()) {
        /* bring the device out of DSM */
        kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
    }
    kw41zrf_abort_sequence(dev);
    kw41zrf_unmask_irqs();
    KW41ZRF_LED_RX_ON;
    kw41zrf_set_sequence(dev, XCVSEQ_CCA);
    /* Wait for the CCA to finish, it will take exactly RX warmup time + 128 µs */
    kw41zrf_wait_idle(dev);
    KW41ZRF_LED_RX_OFF;
    DEBUG("[kw41zrf] CCA: %u RSSI: %d\n", (unsigned)dev->cca_result,
          kw41zrf_get_ed_level(dev));
    return dev->cca_result;
}

static int kw41zrf_netdev_send(netdev_t *netdev, const iolist_t *iolist)
{
    netdev_ieee802154_t *netdev_ieee802154 = container_of(netdev,
                                                          netdev_ieee802154_t,
                                                          netdev);
    kw41zrf_t *dev = container_of(netdev_ieee802154, kw41zrf_t, netdev);

    size_t len = 0;

