RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_netdev.c
    kw41zrf_wait_idle(dev);

    if (kw41zrf_is_dsm()) {
        /* bring the device out of DSM */
        kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
    }

    /* load packet data into buffer */
    for (const iolist_t *iol = iolist; iol; iol = iol->iol_next) {
        /* current packet data + FCS too long */
        if ((len + iol->iol_len) > (KW41ZRF_MAX_PKT_LENGTH - IEEE802154_FCS_LEN)) {
            LOG_ERROR("[kw41zrf] packet too large (%" PRIuSIZE " byte) to fit\n",
                  len + IEEE802154_FCS_LEN);
            return -EOVERFLOW;
        }
        len = kw41zrf_tx_load(iol->iol_base, iol->iol_len, len);
    }

    DEBUG("[kw41zrf] TX %" PRIuSIZE " bytes\n", len);

    /*
     * First octet in the TX buffer contains the frame length.
     * Nbytes = FRAME_LEN - 2 -> FRAME_LEN = Nbytes + 2
     * MKW41Z ref. man. 44.6.2.6.3.1.3 Sequence T (Transmit), p. 2147
     */
    *((volatile uint8_t *)&ZLL->PKT_BUFFER_TX[0]) = len + IEEE802154_FCS_LEN;
#if MODULE_OD && ENABLE_DEBUG
    DEBUG("[kw41zrf] send:\n");
    od_hex_dump((const uint8_t *)ZLL->PKT_BUFFER_TX, len, OD_WIDTH_DEFAULT);
#endif

    /* send data out directly if pre-loading is disabled */
    if (!(dev->flags & KW41ZRF_OPT_PRELOADING)) {
        dev->csma_be = dev->csma_min_be;
        dev->csma_num_backoffs = 0;
        dev->num_retrans = 0;
        kw41zrf_tx_exec(dev);
    }

    return (int)len;
}

static inline void kw41zrf_unblock_rx(kw41zrf_t *dev)
{
    dev->recv_blocked = 0;
    if (kw41zrf_can_switch_to_idle(dev)) {
        kw41zrf_abort_sequence(dev);
        kw41zrf_set_sequence(dev, dev->idle_seq);
    }
    KW41ZRF_LED_RX_OFF;
}

static int kw41zrf_netdev_recv(netdev_t *netdev, void *buf, size_t len, void *info)
{
    netdev_ieee802154_t *netdev_ieee802154 = container_of(netdev,
                                                          netdev_ieee802154_t,
                                                          netdev);
    kw41zrf_t *dev = container_of(netdev_ieee802154, kw41zrf_t, netdev);
    if (kw41zrf_is_dsm()) {
        /* bring the device out of DSM, sleep will be restored before returning */
        kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
    }
    /* get size of the received packet */
    uint8_t pkt_len = (ZLL->IRQSTS & ZLL_IRQSTS_RX_FRAME_LENGTH_MASK) >> ZLL_IRQSTS_RX_FRAME_LENGTH_SHIFT;
    if (pkt_len < IEEE802154_FCS_LEN) {
        kw41zrf_unblock_rx(dev);
        return -EAGAIN;
    }
    /* skip FCS */
    pkt_len -= IEEE802154_FCS_LEN;
    DEBUG("[kw41zrf] RX %u bytes\n", pkt_len);

    /* just return length when buf == NULL */
    if (buf == NULL) {
        if (len > 0) {
            /* discard what we have stored in the buffer, unblock RX */
            kw41zrf_unblock_rx(dev);
        }
        /* No set_sequence(idle_seq) here, keep transceiver turned on if the
         * buffer was not discarded, we expect the higher layer to call again
         * shortly with a proper buffer */
        return pkt_len;
    }

#if MODULE_OD && ENABLE_DEBUG
    DEBUG("[kw41zrf] recv:\n");
    od_hex_dump((const uint8_t *)ZLL->PKT_BUFFER_RX, pkt_len, OD_WIDTH_DEFAULT);
#endif

    if (pkt_len > len) {
        /* not enough space in buf */
        /* discard what we have stored in the buffer, unblock RX */
        kw41zrf_unblock_rx(dev);
        return -ENOBUFS;
    }

    /* Read packet buffer. */
    /* Don't use memcpy to work around a presumed compiler bug in
     * arm-none-eabi-gcc 7.3.1 2018-q2-6 */
    for (int i = 0; i < pkt_len; i++) {
        ((uint8_t *)buf)[i] = ((uint8_t *)ZLL->PKT_BUFFER_RX)[i];
    }

    if (info != NULL) {
        netdev_ieee802154_rx_info_t *radio_info = info;
        radio_info->lqi = (ZLL->LQI_AND_RSSI & ZLL_LQI_AND_RSSI_LQI_VALUE_MASK)
                          >> ZLL_LQI_AND_RSSI_LQI_VALUE_SHIFT;
        radio_info->rssi = (int8_t)((ZLL->LQI_AND_RSSI & ZLL_LQI_AND_RSSI_RSSI_MASK)
                           >> ZLL_LQI_AND_RSSI_RSSI_SHIFT);
    }

    /* Go back to RX mode */
    kw41zrf_unblock_rx(dev);

    return pkt_len;
}

static int kw41zrf_netdev_set_state(kw41zrf_t *dev, netopt_state_t state)
{
    kw41zrf_wait_idle(dev);

    switch (state) {
        case NETOPT_STATE_OFF:
            /* There is no deeper 'off' mode than deep sleep mode */
            /* fall through */
        case NETOPT_STATE_SLEEP:
            if (kw41zrf_is_dsm()) {
                /* Transceiver is already in deep sleep mode */
                break;
            }
            kw41zrf_abort_sequence(dev);
            kw41zrf_set_power_mode(dev, KW41ZRF_POWER_DSM);
            dev->idle_seq = XCVSEQ_DSM_IDLE;
            break;
        case NETOPT_STATE_STANDBY:
            kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
            kw41zrf_abort_sequence(dev);
            dev->idle_seq = XCVSEQ_IDLE;
            kw41zrf_set_sequence(dev, dev->idle_seq);
            break;
        case NETOPT_STATE_IDLE:
            kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
            kw41zrf_abort_sequence(dev);
            dev->idle_seq = XCVSEQ_RECEIVE;
            kw41zrf_set_sequence(dev, dev->idle_seq);
            break;
        case NETOPT_STATE_TX:
            if (dev->flags & KW41ZRF_OPT_PRELOADING) {
                kw41zrf_wait_idle(dev);
                if (kw41zrf_is_dsm()) {
                    /* bring the device out of DSM */
                    kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
                }
                dev->csma_be = dev->csma_min_be;
                dev->csma_num_backoffs = 0;
                dev->num_retrans = 0;
                kw41zrf_tx_exec(dev);
            }
            break;
        case NETOPT_STATE_RESET:
            kw41zrf_reset(dev);
            break;
        default:
            return -ENOTSUP;
    }
    return sizeof(netopt_state_t);
}

static netopt_state_t kw41zrf_netdev_get_state(kw41zrf_t *dev)
{
    (void) dev;
    /* ZLL register access require that the transceiver is powered on and not in
     * deep sleep mode */
    if (kw41zrf_is_dsm()) {
        /* Transceiver is in deep sleep mode */
        return NETOPT_STATE_SLEEP;
    }
    uint32_t seq = (ZLL->PHY_CTRL & ZLL_PHY_CTRL_XCVSEQ_MASK) >> ZLL_PHY_CTRL_XCVSEQ_SHIFT;

    switch (seq) {
        case XCVSEQ_TRANSMIT:
        case XCVSEQ_TX_RX:
            return NETOPT_STATE_TX;

        case XCVSEQ_CCA:
        case XCVSEQ_CONTINUOUS_CCA:
            return NETOPT_STATE_RX;

        case XCVSEQ_RECEIVE:
        {
            uint32_t seq_state = ZLL->SEQ_STATE;
            if (seq_state & ZLL_SEQ_STATE_SFD_DET_MASK) {
                /* SFD detection has been triggered */
                if (seq_state & ZLL_SEQ_STATE_RX_BYTE_COUNT_MASK) {
                    /* packet reception is in progress */
                    return NETOPT_STATE_RX;
                }
            }
            /* NETOPT_STATE_IDLE means on, and listening for incoming packets */
            return NETOPT_STATE_IDLE;
        }

        case XCVSEQ_IDLE:
            /* SEQ_IDLE in kw41z means on, but not listening for incoming traffic */
            return NETOPT_STATE_STANDBY;

        default:
            /* Unknown state */
            LOG_ERROR("[kw41z] in unknown sequence: 0x%02" PRIx32 "\n", seq);
            return NETOPT_STATE_OFF;
    }
}

