RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_netdev.c
int kw41zrf_netdev_get(netdev_t *netdev, netopt_t opt, void *value, size_t len)
{
    netdev_ieee802154_t *netdev_ieee802154 = container_of(netdev,
                                                          netdev_ieee802154_t,
                                                          netdev);
    kw41zrf_t *dev = container_of(netdev_ieee802154, kw41zrf_t, netdev);

    if (dev == NULL) {
        return -ENODEV;
    }

    /* These settings do not require the transceiver to be powered on */
    switch (opt) {
        case NETOPT_STATE:
            assert(len >= sizeof(netopt_state_t));
            *((netopt_state_t *)value) = kw41zrf_netdev_get_state(dev);
            return sizeof(netopt_state_t);

        case NETOPT_PRELOADING:
            assert(len >= sizeof(netopt_enable_t));
            *((netopt_enable_t *)value) =
                !!(dev->flags & KW41ZRF_OPT_PRELOADING);
            return sizeof(netopt_enable_t);

        case NETOPT_PROMISCUOUSMODE:
            assert(len >= sizeof(netopt_enable_t));
            *((netopt_enable_t *)value) =
                !!(dev->flags & KW41ZRF_OPT_PROMISCUOUS);
            return sizeof(netopt_enable_t);

        case NETOPT_RX_START_IRQ:
        case NETOPT_TX_START_IRQ:
        case NETOPT_TX_END_IRQ:
            assert(len >= sizeof(netopt_enable_t));
            *((netopt_enable_t *)value) = NETOPT_ENABLE;
            return sizeof(netopt_enable_t);

        case NETOPT_CSMA:
            assert(len >= sizeof(netopt_enable_t));
            *((netopt_enable_t *)value) =
                !!(dev->flags & KW41ZRF_OPT_CSMA);
            return sizeof(netopt_enable_t);

        case NETOPT_CSMA_RETRIES:
            assert(len >= sizeof(uint8_t));
            *((uint8_t *)value) = dev->csma_max_backoffs;
            return sizeof(uint8_t);

        case NETOPT_CSMA_MAXBE:
            assert(len >= sizeof(uint8_t));
            *((uint8_t *)value) = dev->csma_max_be;
            return sizeof(uint8_t);

        case NETOPT_CSMA_MINBE:
            assert(len >= sizeof(uint8_t));
            *((uint8_t *)value) = dev->csma_min_be;
            return sizeof(uint8_t);

        case NETOPT_RETRANS:
            assert(len >= sizeof(uint8_t));
            *((uint8_t *)value) = dev->max_retrans;
            return sizeof(uint8_t);

        case NETOPT_TX_RETRIES_NEEDED:
            assert(len >= sizeof(uint8_t));
            *((uint8_t *)value) = dev->num_retrans;
            return sizeof(uint8_t);

        case NETOPT_CHANNEL_PAGE:
            assert(len >= sizeof(uint16_t));
            *((uint16_t *)value) = 0;
            return sizeof(uint16_t);

        default:
            break;
    }

    /* The below settings require the transceiver to be powered on */
    unsigned put_to_sleep_when_done = 0;
    if (kw41zrf_is_dsm()) {
        /* Transceiver is in deep sleep mode */
        switch (opt) {
            case NETOPT_CHANNEL:
            case NETOPT_NID:
            case NETOPT_ADDRESS:
            case NETOPT_ADDRESS_LONG:
            case NETOPT_TX_POWER:
            case NETOPT_IS_CHANNEL_CLR:
            case NETOPT_CCA_THRESHOLD:
            case NETOPT_CCA_MODE:
            case NETOPT_LAST_ED_LEVEL:
                kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
#if MODULE_NETOPT
                DEBUG("[kw41zrf] Wake to get opt %s\n", netopt2str(opt));
#else
                DEBUG("[kw41zrf] Wake to get opt %d\n", (int)opt);
#endif
                put_to_sleep_when_done = 1;
                break;

            default:
                break;
        }
    }
    else {
        /* Wait for oscillator ready signal if the CPU is coming out of low
         * power mode */
        while ((RSIM->CONTROL & RSIM_CONTROL_RF_OSC_READY_MASK) == 0) {}
    }

    int res = -ENOTSUP;

    switch (opt) {
        case NETOPT_CHANNEL:
            assert(len >= sizeof(uint16_t));
            *((uint16_t *)value) = (uint16_t)kw41zrf_get_channel(dev);
            res = sizeof(uint16_t);
            break;

        case NETOPT_NID:
            assert(len >= sizeof(uint16_t));
            *((uint16_t *)value) = kw41zrf_get_pan(dev);
            res = sizeof(uint16_t);
            break;

        case NETOPT_ADDRESS:
            assert(len >= sizeof(network_uint16_t));
            kw41zrf_get_addr_short(dev, value);
            res = sizeof(network_uint16_t);
            break;

        case NETOPT_ADDRESS_LONG:
            assert(len >= sizeof(eui64_t));
            kw41zrf_get_addr_long(dev, value);
            *(uint64_t*)value = byteorder_swapll(*(uint64_t*)value);
            res = sizeof(eui64_t);
            break;

        case NETOPT_TX_POWER:
            assert(len >= sizeof(int16_t));
            *((int16_t *)value) = kw41zrf_get_txpower(dev);
            res = sizeof(int16_t);
            break;

        case NETOPT_IS_CHANNEL_CLR:
            assert(len >= sizeof(netopt_enable_t));
            *((netopt_enable_t *)value) = !(kw41zrf_cca(dev));
            res = sizeof(netopt_enable_t);
            break;

        case NETOPT_CCA_THRESHOLD:
            assert(len >= sizeof(int8_t));
            *((int8_t *)value) = kw41zrf_get_cca_threshold(dev);
            res = sizeof(int8_t);
            break;

        case NETOPT_CCA_MODE:
            assert(len >= sizeof(uint8_t));
            uint8_t mode = kw41zrf_get_cca_mode(dev);
            switch (mode) {
                case NETDEV_IEEE802154_CCA_MODE_1:
                case NETDEV_IEEE802154_CCA_MODE_2:
                case NETDEV_IEEE802154_CCA_MODE_3:
                    *((uint8_t *)value) = mode;
                    res = sizeof(uint8_t);
                    break;
                default:
                    res = -EINVAL;
                    break;
            }
            break;

        case NETOPT_LAST_ED_LEVEL:
            assert(len >= sizeof(int8_t));
            *((int8_t *)value) = kw41zrf_get_ed_level(dev);
            res = sizeof(int8_t);
            break;

        default:
            break;
    }

    if (put_to_sleep_when_done) {
        DEBUG("[kw41zrf] Go back to sleep\n");
        kw41zrf_set_power_mode(dev, KW41ZRF_POWER_DSM);
    }

    if (res == -ENOTSUP) {
        res = netdev_ieee802154_get(container_of(netdev, netdev_ieee802154_t, netdev),
                                    opt, value, len);
    }
    return res;
}

static int kw41zrf_netdev_set(netdev_t *netdev, netopt_t opt, const void *value, size_t len)
{
    netdev_ieee802154_t *netdev_ieee802154 = container_of(netdev,
                                                          netdev_ieee802154_t,
                                                          netdev);
    kw41zrf_t *dev = container_of(netdev_ieee802154, kw41zrf_t, netdev);
    int res = -ENOTSUP;

    if (dev == NULL) {
        return -ENODEV;
    }

