RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_netdev.c
    kw41zrf_wait_idle(dev);

    /* These settings do not require the transceiver to be awake */
    switch (opt) {
        case NETOPT_STATE:
            assert(len <= sizeof(const netopt_state_t));
            res = kw41zrf_netdev_set_state(dev, *((const netopt_state_t *)value));
            break;

        case NETOPT_PRELOADING:
            assert(len <= sizeof(const netopt_enable_t));
            kw41zrf_set_option(dev, KW41ZRF_OPT_PRELOADING,
                               *((const netopt_enable_t *)value));
            res = sizeof(const netopt_enable_t);
            break;

        case NETOPT_CSMA_RETRIES:
            assert(len <= sizeof(uint8_t));
            dev->csma_max_backoffs = *((const uint8_t*)value);
            res = sizeof(uint8_t);
            break;

        case NETOPT_CSMA_MAXBE:
            assert(len <= sizeof(uint8_t));
            dev->csma_max_be = *((const uint8_t*)value);
            res = sizeof(uint8_t);
            break;

        case NETOPT_CSMA_MINBE:
            assert(len <= sizeof(uint8_t));
            dev->csma_min_be = *((const uint8_t*)value);
            res = sizeof(uint8_t);
            break;

        case NETOPT_RETRANS:
            assert(len <= sizeof(uint8_t));
            dev->max_retrans = *((const uint8_t *)value);
            res = sizeof(uint8_t);
            break;

        default:
            break;
    }

    unsigned put_to_sleep_when_done = 0;

    if (kw41zrf_is_dsm()) {
        /* Transceiver is in deep sleep mode, check if setting the option
         * requires the radio powered on */
        switch (opt) {
            case NETOPT_AUTOACK:
            case NETOPT_PROMISCUOUSMODE:
            case NETOPT_RX_START_IRQ:
            case NETOPT_CSMA:
            case NETOPT_ADDRESS:
            case NETOPT_ADDRESS_LONG:
            case NETOPT_NID:
            case NETOPT_CHANNEL:
            case NETOPT_TX_POWER:
            case NETOPT_CCA_THRESHOLD:
            case NETOPT_CCA_MODE:
                kw41zrf_set_power_mode(dev, KW41ZRF_POWER_IDLE);
#if MODULE_NETOPT
                DEBUG("[kw41zrf] Wake to set opt %s\n", netopt2str(opt));
#else
                DEBUG("[kw41zrf] Wake to set opt %d\n", (int)opt);
#endif
                put_to_sleep_when_done = 1;
                break;

            default:
                break;
        }
    }

    switch (opt) {
        case NETOPT_AUTOACK:
            /* Set up HW generated automatic ACK after Receive */
            assert(len <= sizeof(const netopt_enable_t));
            kw41zrf_set_option(dev, KW41ZRF_OPT_AUTOACK,
                               *((const netopt_enable_t *)value));
            res = sizeof(const netopt_enable_t);
            break;

        case NETOPT_ACK_PENDING:
            /* Enable pending bit on automatic hardware ACKs */
            assert(len <= sizeof(const netopt_enable_t));
            kw41zrf_set_option(dev, KW41ZRF_OPT_ACK_PENDING,
                               *((const netopt_enable_t *)value));
            res = sizeof(const netopt_enable_t);
            break;

        case NETOPT_PROMISCUOUSMODE:
            assert(len <= sizeof(const netopt_enable_t));
            kw41zrf_set_option(dev, KW41ZRF_OPT_PROMISCUOUS,
                               *((const netopt_enable_t *)value));
            res = sizeof(const netopt_enable_t);
            break;

        case NETOPT_CSMA:
            assert(len <= sizeof(const netopt_enable_t));
            kw41zrf_set_option(dev, KW41ZRF_OPT_CSMA,
                               ((const netopt_enable_t *)value)[0]);
            res = sizeof(const netopt_enable_t);
            break;

        case NETOPT_ADDRESS:
            assert(len <= sizeof(const network_uint16_t));
            kw41zrf_set_addr_short(dev, value);
            res = sizeof(const network_uint16_t);
            break;

        case NETOPT_ADDRESS_LONG: {
            eui64_t addr;
            assert(len <= sizeof(const eui64_t));
            addr.uint64.u64 = byteorder_swapll(*(uint64_t*)value);
            kw41zrf_set_addr_long(dev, &addr);
            res = sizeof(const eui64_t);
            break;
        }

        case NETOPT_NID:
            assert(len <= sizeof(const uint16_t));
            kw41zrf_set_pan(dev, *((const uint16_t *)value));
            /* TODO uncomment this when the upper layer code is refactored to
             * not need netdev_t::pan */
            //~ res = sizeof(const uint16_t);
            break;

        case NETOPT_CHANNEL:
            assert(len <= sizeof(const uint16_t));
            if (kw41zrf_set_channel(dev, *((const uint16_t *)value))) {
                res = -EINVAL;
                break;
            }
            res = sizeof(const uint16_t);
            kw41zrf_abort_sequence(dev);
            kw41zrf_set_sequence(dev, dev->idle_seq);
            break;

        case NETOPT_TX_POWER:
            assert(len <= sizeof(const int16_t));
            kw41zrf_set_tx_power(dev, *(const int16_t *)value);
            res = sizeof(const int16_t);
            break;

        case NETOPT_CCA_THRESHOLD:
            assert(len <= sizeof(const uint8_t));
            kw41zrf_set_cca_threshold(dev, *((const uint8_t*)value));
            res = sizeof(const uint8_t);
            break;

        case NETOPT_CCA_MODE:
            assert(len <= sizeof(const uint8_t));
            uint8_t mode = *((const uint8_t*)value);
            switch (mode) {
                case NETDEV_IEEE802154_CCA_MODE_1:
                case NETDEV_IEEE802154_CCA_MODE_2:
                case NETDEV_IEEE802154_CCA_MODE_3:
                    kw41zrf_set_cca_mode(dev, mode);
                    res = sizeof(const uint8_t);
                    break;
                case NETDEV_IEEE802154_CCA_MODE_4:
                case NETDEV_IEEE802154_CCA_MODE_5:
                case NETDEV_IEEE802154_CCA_MODE_6:
                default:
                    res = -EINVAL;
                    break;
            }
            break;

        default:
            break;
    }

    if (put_to_sleep_when_done) {
        DEBUG("[kw41zrf] Go back to sleep\n");
        kw41zrf_set_power_mode(dev, KW41ZRF_POWER_DSM);
    }

    if (res == -ENOTSUP) {
        res = netdev_ieee802154_set(container_of(netdev, netdev_ieee802154_t, netdev),
                                    opt, value, len);
    }

    return res;
}

/* Common CCA check handler code for sequences Transmit and Transmit/Receive */
static uint32_t _isr_event_seq_t_ccairq(kw41zrf_t *dev, uint32_t irqsts)
{
    uint32_t handled_irqs = 0;
    if (irqsts & ZLL_IRQSTS_TMR2IRQ_MASK) {
        assert(!(irqsts & ZLL_IRQSTS_CCAIRQ_MASK));
        handled_irqs |= ZLL_IRQSTS_TMR2IRQ_MASK;

