RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_netdev.c
        dev->tx_timeout = 0;
        /* Check FCF field in the TX buffer to see if the ACK_REQ flag was set in
         * the packet that is queued for transmission */
        uint16_t len_fcf = ZLL->PKT_BUFFER_TX[0];
        uint8_t fcf = (len_fcf >> 8) & 0xff;
        if ((fcf & IEEE802154_FCF_ACK_REQ) &&
            (dev->netdev.flags & NETDEV_IEEE802154_ACK_REQ)) {
            uint8_t payload_len = len_fcf & 0xff;
            dev->tx_timeout = dev->backoff_delay + dev->tx_warmup_time +
                KW41ZRF_SHR_PHY_TIME + payload_len * KW41ZRF_PER_BYTE_TIME +
                KW41ZRF_ACK_WAIT_TIME + 2;
        }

        KW41ZRF_LED_TX_ON;
        if (dev->tx_timeout) {
            kw41zrf_set_sequence(dev, XCVSEQ_TX_RX | ZLL_PHY_CTRL_TC3TMOUT_MASK);
        }
        else {
            kw41zrf_set_sequence(dev, XCVSEQ_TRANSMIT);
        }

        if (dev->tx_timeout > 0) {
            /* Set real timeout for RX ACK */
            kw41zrf_timer_set(dev, &ZLL->T3CMP, dev->tx_timeout);
        }

        dev->backoff_delay = 0;
        /* disable TMR2 match */
        bit_clear32(&ZLL->PHY_CTRL, ZLL_PHY_CTRL_TMR2CMP_EN_SHIFT);
    }
    if (irqsts & ZLL_IRQSTS_CCAIRQ_MASK) {
        /* CCA before TX has completed */
        handled_irqs |= ZLL_IRQSTS_CCAIRQ_MASK;
        if (irqsts & ZLL_IRQSTS_CCA_MASK) {
            /* Channel was determined busy */
            if (irqsts & ZLL_IRQSTS_SEQIRQ_MASK) {
                handled_irqs |= ZLL_IRQSTS_SEQIRQ_MASK;
                kw41zrf_abort_sequence(dev);
                KW41ZRF_LED_TX_OFF;
            }

            LOG_DEBUG("[kw41zrf] CCA ch busy (RSSI: %d retry: %u)\n",
                  (int8_t)((ZLL->LQI_AND_RSSI & ZLL_LQI_AND_RSSI_CCA1_ED_FNL_MASK) >>
                ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT),
                dev->csma_num_backoffs
            );

            if (dev->csma_num_backoffs < dev->csma_max_backoffs) {
                /* Perform CSMA/CA backoff algorithm */
                ++dev->csma_num_backoffs;
                if (dev->csma_be < dev->csma_max_be) {
                    /* Increase delay exponent */
                    ++dev->csma_be;
                }
                /* Resubmit the frame for transmission */
                kw41zrf_tx_exec(dev);
                return handled_irqs;
            }

            /* If we get here we've used up the csma retries and we're done */
            kw41zrf_abort_sequence(dev);
            kw41zrf_set_sequence(dev, dev->idle_seq);

            if (dev->netdev.netdev.event_callback) {
                dev->netdev.netdev.event_callback(&dev->netdev.netdev, NETDEV_EVENT_TX_MEDIUM_BUSY);
                LOG_INFO("[kw41zrf] dropping frame after %u backoffs\n",
                          dev->csma_num_backoffs);
            }

        }
        else {
            /* Channel is idle */
            DEBUG("[kw41zrf] CCA ch idle (RSSI: %d retries: %u)\n",
                  (int8_t)((ZLL->LQI_AND_RSSI & ZLL_LQI_AND_RSSI_CCA1_ED_FNL_MASK) >>
                  ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT),
                  dev->csma_num_backoffs
            );
            if (dev->netdev.netdev.event_callback) {
                /* TX will start automatically after CCA check succeeded */
                dev->netdev.netdev.event_callback(&dev->netdev.netdev, NETDEV_EVENT_TX_STARTED);
            }
        }
    }
    return handled_irqs;
}

/* Handler for Receive sequence */
static uint32_t _isr_event_seq_r(kw41zrf_t *dev, uint32_t irqsts)
{
    uint32_t handled_irqs = 0;

    if (irqsts & ZLL_IRQSTS_RXWTRMRKIRQ_MASK) {
        DEBUG("[kw41zrf] RXWTRMRKIRQ (R)\n");
        handled_irqs |= ZLL_IRQSTS_RXWTRMRKIRQ_MASK;
        if (dev->netdev.netdev.event_callback) {
            dev->netdev.netdev.event_callback(&dev->netdev.netdev, NETDEV_EVENT_RX_STARTED);
        }
    }

    if (irqsts & ZLL_IRQSTS_FILTERFAIL_IRQ_MASK) {
        KW41ZRF_LED_RX_OFF;
        DEBUG("[kw41zrf] FILTERFAILIRQ: %04"PRIx32"\n", ZLL->FILTERFAIL_CODE);
        handled_irqs |= ZLL_IRQSTS_FILTERFAIL_IRQ_MASK;
    }

    if (irqsts & ZLL_IRQSTS_RXIRQ_MASK) {
        KW41ZRF_LED_RX_ON;
        DEBUG("[kw41zrf] finished RX\n");
        handled_irqs |= ZLL_IRQSTS_RXIRQ_MASK;
        DEBUG("[kw41zrf] RX len: %3u\n",
            (unsigned int)((ZLL->IRQSTS & ZLL_IRQSTS_RX_FRAME_LENGTH_MASK) >>
            ZLL_IRQSTS_RX_FRAME_LENGTH_SHIFT));
        if (ZLL->PHY_CTRL & ZLL_PHY_CTRL_AUTOACK_MASK) {
            KW41ZRF_LED_TX_ON;
            DEBUG("[kw41zrf] perform TXACK\n");
        }
    }

    if (irqsts & ZLL_IRQSTS_TXIRQ_MASK) {
        KW41ZRF_LED_TX_OFF;
        DEBUG("[kw41zrf] finished TXACK\n");
        handled_irqs |= ZLL_IRQSTS_TXIRQ_MASK;
    }

    if (irqsts & ZLL_IRQSTS_SEQIRQ_MASK) {
        uint32_t seq_ctrl_sts = ZLL->SEQ_CTRL_STS;
        kw41zrf_abort_sequence(dev);

        DEBUG("[kw41zrf] SEQIRQ (R)\n");
        handled_irqs |= ZLL_IRQSTS_SEQIRQ_MASK;
        KW41ZRF_LED_TX_OFF;
        if ((irqsts & ZLL_IRQSTS_CRCVALID_MASK) == 0) {
            DEBUG("[kw41zrf] CRC failure (R)\n");
        }
        else if (seq_ctrl_sts & ZLL_SEQ_CTRL_STS_TC3_ABORTED_MASK) {
            DEBUG("[kw41zrf] RX timeout (R)\n");
        }
        else if (seq_ctrl_sts & ZLL_SEQ_CTRL_STS_PLL_ABORTED_MASK) {
            LOG_ERROR("[kw41zrf] PLL unlock (R)\n");
        }
        else if (seq_ctrl_sts & ZLL_SEQ_CTRL_STS_SW_ABORTED_MASK) {
            LOG_ERROR("[kw41zrf] SW abort (R)\n");
        }
        else {
            /* No error reported */
            DEBUG("[kw41zrf] success (R)\n");
            /* Block XCVSEQ_RECEIVE until netdev->recv has been called */
            dev->recv_blocked = 1;
            kw41zrf_set_sequence(dev, dev->idle_seq);
            if (dev->netdev.netdev.event_callback) {
                dev->netdev.netdev.event_callback(&dev->netdev.netdev, NETDEV_EVENT_RX_COMPLETE);
            }
            return handled_irqs;
        }

        kw41zrf_set_sequence(dev, dev->idle_seq);
    }

    return handled_irqs;
}

